### Task 1: Create the database connection

In [2]:
# Importing Liabraries
import mysql.connector
from mysql.connector import Error
import pandas as pd
import numpy as np

In [4]:
# Connecting to the database
connection = mysql.connector.connect(host = 'localhost',
                                    user = 'root',
                                    password = 'Tanmay@2002')

# Checcking connection with try and Except 
try:
    if connection.is_connected():
            db_info = connection.get_server_info()
            print('You are connected to the MySQl server',db_info)
            
except Error as e:
    print("Connection failed due to ",e)

You are connected to the MySQl server 8.0.26

In [5]:
#Creating Cursor Object
cursor = connection.cursor()

In [7]:
#Run Quaries and Result
cursor.execute('show databases')

result = cursor.fetchall()
result

[('hr',),
 ('information_schema',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('tanmay',),
 ('world',)]

#

### Task 2: Create a table in the database

In [15]:
# Creating table in database with the help of python
cursor.execute("create table PET(ID integer primary key not null,Animal varchar(20),Quantity int,cost decimal(6,2),rescuedate date)")

#

### Task 3: Insert data into the table

In [36]:
# Inserting values in table
cursor.execute("insert into PET values(1,'Cat',9,450.09,'2018-05-29'),(2,'Dog',3,666.66,'2018-06-01'),(3,'Dog',1,100.00,'2018-06-04'),(4,'Parrot',2,50.00,'2018-06-04'),(5,'Dog',1,75.75,'2018-06-10'),(6,'Hamster',6,60.60,'2018-06-11');")

### Task 4: Retrieve data into the table

In [37]:
#Run Quaries and see the Result
result = pd.read_sql('select * from PET',connection)

#result = cursor.fetchall()
result

   ID   Animal  Quantity    cost  rescuedate
0   1      Cat         9  450.09  2018-05-29
1   2      Dog         3  666.66  2018-06-01
2   3      Dog         1  100.00  2018-06-04
3   4   Parrot         2   50.00  2018-06-04
4   5      Dog         1   75.75  2018-06-10
5   6  Hamster         6   60.60  2018-06-11

#

### Distinct
- It is used to remove Duplicate values from a result set

In [40]:
result = pd.read_sql('select distinct Animal from PET',connection)
result

    Animal
0      Cat
1      Dog
2   Parrot
3  Hamster

#

### Limit
-It is used for restricting the no of rows retrieved from the dataset

In [42]:
result = pd.read_sql('select * from PET LIMIT 3',connection)
result

   ID Animal  Quantity    cost  rescuedate
0   1    Cat         9  450.09  2018-05-29
1   2    Dog         3  666.66  2018-06-01
2   3    Dog         1  100.00  2018-06-04

#

### Update & Delete
-After creating a table and inserting the data into the table, we can alter the data

In [46]:
# Update Statement
cursor.execute("update PET set Animal ='peacock' where ID = 3")
result = pd.read_sql('select * from PET',connection)
result

   ID   Animal  Quantity    cost  rescuedate
0   1      Cat         9  450.09  2018-05-29
1   2      Dog         3  666.66  2018-06-01
2   3  peacock         1  100.00  2018-06-04
3   4   Parrot         2   50.00  2018-06-04
4   5      Dog         1   75.75  2018-06-10
5   6  Hamster         6   60.60  2018-06-11

In [47]:
# Delete Statement
cursor.execute("delete from PET where ID = 6")
result = pd.read_sql('select * from PET',connection)
result

   ID   Animal  Quantity    cost  rescuedate
0   1      Cat         9  450.09  2018-05-29
1   2      Dog         3  666.66  2018-06-01
2   3  peacock         1  100.00  2018-06-04
3   4   Parrot         2   50.00  2018-06-04
4   5      Dog         1   75.75  2018-06-10

#

### Primary Key & Foreign key

-Primary key uniquely identifies each touple or row in a table, preventing Duplication of data and providing a way of defining relationship betn tables.

-Tables are also contain foreign keys which are primary keys defined in other tables, creating a link betn tables.

In [8]:
cursor.close()

True